ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/CANFD0_1.0.xml
        <register id="CANFD0_MCAN_IE" width="32" offset="0x54" description="MCAN Interrupt Enable">
            <bitfield id="RF0NE" description="Rx FIFO 0 New Message Enable" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0WE" description="Rx FIFO 0 Watermark Reached Enable" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0FE" description="Rx FIFO 0 Full Enable" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0LE" description="Rx FIFO 0 Message Lost Enable" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1NE" description="Rx FIFO 1 New Message Enable" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1WE" description="Rx FIFO 1 Watermark Reached Enable" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1FE" description="Rx FIFO 1 Full Enable" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1LE" description="Rx FIFO 1 Message Lost Enable" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="HPME" description="High Priority Message Enable" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCE" description="Transmission Completed Enable" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCFE" description="Transmission Cancellation Finished Enable" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFEE" description="Tx FIFO Empty Enable" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFNE" description="Tx Event FIFO New Entry Enable" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFWE" description="Tx Event FIFO Watermark Reached Enable" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFFE" description="Tx Event FIFO Full Enable" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFLE" description="Tx Event FIFO Element Lost Enable" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TSWE" description="Timestamp Wraparound Enable" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="MRAFE" description="Message RAM Access Failure Enable" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TOOE" description="Timeout Occurred Enable" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="DRXE" description="Message Stored to Dedicated Rx Buffer Enable" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BECE" description="Bit Error Corrected Enable
 
A separate interrupt line reserved for corrected bit errors is provided via the MCAN_ERROR_REGS. It advised for the user to use these registers and leave this bit cleared to '0'." begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BEUE" description="Bit Error Uncorrected Enable" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ELOE" description="Error Logging Overflow Enable" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EPE" description="Error Passive Enable" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EWE" description="Warning Status Enable" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BOE" description="Bus_Off Status Enable" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="WDIE" description="Watchdog Interrupt Enable" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PEAE" description="Protocol Error in Arbitration Phase Enable" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PEDE" description="Protocol Error in Data Phase Enable" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ARAE" description="Access to Reserved Address Enable" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD0_MCAN_ILS" width="32" offset="0x58" description="MCAN Interrupt Line Select">
            <bitfield id="RF0NL" description="Rx FIFO 0 New Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0WL" description="Rx FIFO 0 Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0FL" description="Rx FIFO 0 Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF0LL" description="Rx FIFO 0 Message Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="3" end="3" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1NL" description="Rx FIFO 1 New Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1WL" description="Rx FIFO 1 Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1FL" description="Rx FIFO 1 Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="RF1LL" description="Rx FIFO 1 Message Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="HPML" description="High Priority Message Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCL" description="Transmission Completed Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TCFL" description="Transmission Cancellation Finished Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="10" end="10" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFEL" description="Tx FIFO Empty Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="11" end="11" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFNL" description="Tx Event FIFO New Entry Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="12" end="12" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFWL" description="Tx Event FIFO Watermark Reached Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="13" end="13" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFFL" description="Tx Event FIFO Full Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="14" end="14" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEFLL" description="Tx Event FIFO Element Lost Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="15" end="15" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TSWL" description="Timestamp Wraparound Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="16" end="16" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="MRAFL" description="Message RAM Access Failure Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="17" end="17" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TOOL" description="Timeout Occurred Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="18" end="18" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="DRXL" description="Message Stored to Dedicated Rx Buffer Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="19" end="19" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BECL" description="Bit Error Corrected Line
 
A separate interrupt line reserved for corrected bit errors is provided via the MCAN_ERROR_REGS. It advised for the user to use these registers and leave the MCAN_IE.BECE bit cleared to '0' (disabled), thereby relegating this bit to not applicable." begin="20" end="20" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BEUL" description="Bit Error Uncorrected Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="21" end="21" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ELOL" description="Error Logging Overflow Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="22" end="22" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EPL" description="Error Passive Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="EWL" description="Warning Status Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="24" end="24" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BOL" description="Bus_Off Status Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="25" end="25" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="WDIL" description="Watchdog Interrupt Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="26" end="26" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PEAL" description="Protocol Error in Arbitration Phase Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="27" end="27" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PEDL" description="Protocol Error in Data Phase Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="28" end="28" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ARAL" description="Access to Reserved Address Line
  0  Interrupt source is assigned to Interrupt Line 0
  1  Interrupt source is assigned to Interrupt Line 1" begin="29" end="29" width="1" rwaccess="R/W">
            </bitfield>
        </register>
